Copyright Jana Schaich Borg/Attribution-NonCommercial 4.0 International (CC BY-NC 4.0)

# MySQL Exercise 5: Summaries of Groups of Data

So far you've learned how to select, reformat, manipulate, order, and summarize data from a single table in database.  In this lesson, you are going to learn how to summarize multiple subsets of your data in the same query.  The method for doing this is to include a "GROUP BY" clause in your SQL query.  
  
    

## The GROUP BY clause

The GROUP BY clause comes after the WHERE clause, but before ORDER BY or LIMIT:

<img src="https://duke.box.com/shared/static/lc0yjfz1339q3mc04ne13m2q5tkzy3x7.jpg" width=400 alt="SELECT FROM WHERE ORDER BY" />

The GROUP BY clause is easy to incorporate into your queries.  In fact, it might be a little too easy to incorporate into MySQL queries, because it can be used incorrectly in MySQL queries even when no error message is displayed.  As a consequence, I suggest you adopt a healthy dose of caution every time you use the GROUP BY clause.  By the end of this lesson, you will understand why.  When used correctly, though, GROUP BY is one of the most useful and efficient parts of an SQL query, and once you are comfortable using it, you will use it very frequently.

**To get started, load the SQL library and the Dognition database, and set the dognition database as the default:**

In [1]:
%load_ext sql
%sql mysql://studentuser:studentpw@localhost/dognitiondb
%sql USE dognitiondb

 * mysql://studentuser:***@localhost/dognitiondb
0 rows affected.

[]

Let's return to a question from MySQL Exercise 4.  How would you query the average rating for each of the 40 tests in the Reviews table? As we discussed, one very inefficient method to do that would be to write 40 separate queries with each one having a different test name in the WHERE conditional clause.  Then you could copy or transcribe the results from all 40 queries into one place.  But that wouldn't be very pleasant.  Here's how you could do the same thing using one query that has a GROUP BY clause:

```mySQL
SELECT test_name, AVG(rating) AS AVG_Rating
FROM reviews
GROUP BY test_name
```

This query will output the average rating for each test.  More technically, this query will instruct MySQL to average all the rows that have the same value in the test_name column.

Notice that I included test_name in the SELECT statement.  As a strong rule of thumb, if you are grouping by a column, you should also include that column in the SELECT statement.  If you don't do this, you won't know to which group each row of your output corresponds.  
     
**To see what I mean, try the query above without test_name included in the SELECT statement:**

In [5]:
%%sql
SELECT AVG(rating) AS AVG_Rating
FROM reviews
GROUP BY test_name
LIMIT 5

 * mysql://studentuser:***@localhost/dognitiondb
5 rows affected.

[(Decimal('3.9206'),),
 (Decimal('4.2857'),),
 (Decimal('3.9272'),),
 (Decimal('4.2153'),),
 (Decimal('2.6741'),)]

You can form groups using derived values as well as original columns.  To illustrate this, let's address another question: how many tests were completed during each month of the year?

To answer this question, we need to take advantage of another datetime function described in the website below:

http://www.w3resource.com/mysql/date-and-time-functions/date-and-time-functions.php

MONTH() will return a number representing the month of a date entry. To get the total number of tests completed each month, you could put the MONTH function into the GROUP BY clause, in this case through an alias:

```mySQL
SELECT test_name, MONTH(created_at) AS Month, COUNT(created_at) AS Num_Completed_Tests
FROM complete_tests
GROUP BY Month;
```

You can also group by multiple columns or derived fields.  If we wanted to determine the total number of each type of test completed each month, you could include both "test_name" and the derived "Month" field in the GROUP BY clause, separated by a comma.

```mySQL
SELECT test_name, MONTH(created_at) AS Month, COUNT(created_at) AS Num_Completed_Tests
FROM complete_tests
GROUP BY test_name, Month;
```

MySQL allows you to use aliases in a GROUP BY clause, but some database systems do not.  If you are using a database system that does NOT accept aliases in GROUP BY clauses, you can still group by derived fields, but you have to duplicate the calculation for the derived field in the GROUP BY clause in addition to including the derived field in the SELECT clause:

```mySQL
SELECT test_name, MONTH(created_at) AS Month, COUNT(created_at) AS Num_Completed_Tests
FROM complete_tests
GROUP BY test_name, MONTH(created_at);
```  
  
Try the query once with test_name first in the GROUP BY list, and once with Month first in the GROUP BY list below.  Inspect the outputs:

In [2]:
%%sql
SELECT test_name, MONTH(created_at) AS Month, COUNT(created_at) AS Num_Completed_Tests
FROM complete_tests
GROUP BY test_name, Month
LIMIT 10

 * mysql://studentuser:***@localhost/dognitiondb
10 rows affected.

[('1 vs 1 Game', 1, 25),
 ('1 vs 1 Game', 2, 28),
 ('1 vs 1 Game', 3, 22),
 ('1 vs 1 Game', 4, 12),
 ('1 vs 1 Game', 5, 13),
 ('1 vs 1 Game', 6, 18),
 ('1 vs 1 Game', 7, 36),
 ('1 vs 1 Game', 8, 17),
 ('1 vs 1 Game', 9, 28),
 ('1 vs 1 Game', 10, 27)]

In [3]:
%%sql
SELECT test_name, MONTH(created_at) AS Month, COUNT(created_at) AS Num_Completed_Tests
FROM complete_tests
GROUP BY Month, test_name
LIMIT 10

 * mysql://studentuser:***@localhost/dognitiondb
10 rows affected.

[('1 vs 1 Game', 1, 25),
 ('3 vs 1 Game', 1, 35),
 ('5 vs 1 Game', 1, 59),
 ('Arm Pointing', 1, 622),
 ('Cover Your Eyes', 1, 452),
 ('Delayed Cup Game', 1, 356),
 ('Different Perspective', 1, 2),
 ('Expression Game', 1, 6),
 ('Eye Contact Game', 1, 624),
 ('Eye Contact Warm-up', 1, 707)]

Notice that in the first case, the first block of rows share the same test_name, but are broken up into separate months (for those of you who took the "Data Visualization and Communication with Tableau" course of this specialization, this is similar to what would happen if you put test_name first and created_at second on the rows or columns shelf in Tableau).  

In the second case, the first block of rows share the same month, but are broken up into separate tests  (this is similar to what would happen if you put created_at first and test_name second on the rows or columns shelf in Tableau).  If you were to visualize these outputs, they would look like the charts below.

<img src="https://duke.box.com/shared/static/y6l3ldxg289brid5mmn886qweglt65qv.jpg" width=800 alt="ORDER" />

Different database servers might default to ordering the outputs in a certain way, but you shouldn't rely on that being the case.  To ensure the output is ordered in a way you intend, add an ORDER BY clause to your grouped query using the syntax you already know and have practiced:

```mySQL
SELECT test_name, MONTH(created_at) AS Month, COUNT(created_at) AS Num_Completed_Tests
FROM complete_tests
GROUP BY test_name, Month
ORDER BY test_name ASC, Month ASC;
```

**Question 1: Output a table that calculates the number of distinct female and male dogs in each breed group of the Dogs table, sorted by the total number of dogs in descending order (the sex/breed_group pair with the greatest number of dogs should have 8466 unique Dog_Guids):**

In [16]:
%%sql
SELECT *
FROM dogs
LIMIT 5

 * mysql://studentuser:***@localhost/dognitiondb
5 rows affected.

[('female', '2011', 'Labrador Retriever', 50, 1, 0, datetime.datetime(2013, 2, 5, 3, 57, 19), datetime.datetime(2013, 7, 25, 19, 41, 49), 'charmer', None, 'Pure Breed', 'Sporting', 'fd27b272-7144-11e5-ba71-058fbc01cf0b', 'ce134e42-7144-11e5-ba71-058fbc01cf0b', '21', '28.20107581', '40609.549167', '0.004687499952', '6.7499999308', '564.0215162', '812190.98333'),
 ('male', '2007', 'Shetland Sheepdog', 20, 1, 0, datetime.datetime(2013, 2, 5, 15, 35, 9), datetime.datetime(2013, 7, 25, 19, 41, 49), 'protodog', None, 'Pure Breed', 'Herding', 'fd27b5ba-7144-11e5-ba71-058fbc01cf0b', 'ce1353d8-7144-11e5-ba71-058fbc01cf0b', '20', '0.41330713937', '595.1622807', '0.0058449074865', '8.4166667806', '7.8528356481', '11308.083333'),
 ('male', '2012', 'Golden Retriever', 70, 0, 1, datetime.datetime(2013, 2, 5, 17, 22, 56), datetime.datetime(2013, 7, 25, 19, 41, 49), None, None, 'Pure Breed', 'Sporting', 'fd27b6b4-7144-11e5-ba71-058fbc01cf0b', 'ce135ab8-7144-11e5-ba71-058fbc01cf0b', '2', '0.0091319445066', '13.15000009', '0.0091319445066', '13.15000009', '0.0091319445066', '13.15000009'),
 ('male', '2011', 'Golden Retriever', 70, 0, 0, datetime.datetime(2013, 2, 5, 17, 40, 57), datetime.datetime(2014, 5, 30, 15, 52, 53), None, None, 'Pure Breed', 'Sporting', 'fd27b79a-7144-11e5-ba71-058fbc01cf0b', 'ce13507c-7144-11e5-ba71-058fbc01cf0b', '11', '56.115179398', '80805.858333', '0.0044328703647', '6.3833333252', '561.15179398', '808058.58333'),
 ('female', '2010', 'Shih Tzu', 190, 0, 0, datetime.datetime(2013, 2, 5, 18, 12, 28), datetime.datetime(2014, 5, 30, 15, 52, 54), 'einstein', 1, 'Pure Breed', 'Toy', 'fd27b86c-7144-11e5-ba71-058fbc01cf0b', 'ce135e14-7144-11e5-ba71-058fbc01cf0b', '31', '7.7342542438', '11137.326111', '0.00039930554425', '0.57499998372', '232.02762731', '334119.78333')]

In [18]:
%%sql
SELECT gender, breed_group, COUNT(DISTINCT dog_guid) AS Num_Dogs
FROM dogs
GROUP BY breed_group, gender
ORDER BY Num_Dogs DESC;

 * mysql://studentuser:***@localhost/dognitiondb
18 rows affected.

[('male', None, 8466),
 ('female', None, 8367),
 ('male', 'Sporting', 2584),
 ('female', 'Sporting', 2262),
 ('male', 'Herding', 1736),
 ('female', 'Herding', 1704),
 ('male', 'Toy', 1473),
 ('female', 'Toy', 1145),
 ('male', 'Non-Sporting', 1098),
 ('male', 'Working', 1075),
 ('female', 'Non-Sporting', 919),
 ('male', 'Terrier', 919),
 ('female', 'Working', 895),
 ('female', 'Terrier', 794),
 ('male', 'Hound', 725),
 ('female', 'Hound', 614),
 ('male', '', 147),
 ('female', '', 127)]

Some database servers, including MySQL, allow you to use numbers in place of field names in the GROUP BY or ORDER BY fields to reduce the overall length of the queries.  I tend to avoid this abbreviated method of writing queries because I find it challenging to troubleshoot when you are writing complicated queries with many fields, but it does allow you to write queries faster.  To use this method, assign each field in your SELECT statement a number acording to the order the field appears in the SELECT statement.  In the following statement:

```mySQL
SELECT test_name, MONTH(created_at) AS Month, COUNT(created_at) AS Num_Completed_Tests
```

test_name would be #1, Month would be #2, and Num_Completed_Tests would be #3.  You could then rewrite the query above to read:

```mySQL
SELECT test_name, MONTH(created_at) AS Month, COUNT(created_at) AS Num_Completed_Tests
FROM complete_tests
GROUP BY 1, 2
ORDER BY 1 ASC, 2 ASC;
```

**Question 2: Revise the query your wrote in Question 1 so that it uses only numbers in the GROUP BY and ORDER BY fields.**

In [19]:
%%sql
SELECT gender, breed_group, COUNT(DISTINCT dog_guid) AS Num_Dogs
FROM dogs
GROUP BY 2, 1
ORDER BY 3 DESC;

 * mysql://studentuser:***@localhost/dognitiondb
18 rows affected.

[('male', None, 8466),
 ('female', None, 8367),
 ('male', 'Sporting', 2584),
 ('female', 'Sporting', 2262),
 ('male', 'Herding', 1736),
 ('female', 'Herding', 1704),
 ('male', 'Toy', 1473),
 ('female', 'Toy', 1145),
 ('male', 'Non-Sporting', 1098),
 ('male', 'Working', 1075),
 ('female', 'Non-Sporting', 919),
 ('male', 'Terrier', 919),
 ('female', 'Working', 895),
 ('female', 'Terrier', 794),
 ('male', 'Hound', 725),
 ('female', 'Hound', 614),
 ('male', '', 147),
 ('female', '', 127)]

## The HAVING clause

Just like you can query subsets of rows using the WHERE clause, you can query subsets of aggregated groups using the HAVING clause.  However, wheras the expression that follows a WHERE clause has to be applicable to each row of data in a column, the expression that follows a HAVING clause has to be applicable or computable using a group of data.  

If you wanted to examine the number of tests completed only during the winter holiday months of November and December, you would need to use a WHERE clause, because the month a test was completed in is recorded in each row.  Your query might look like this:

```mySQL
SELECT test_name, MONTH(created_at) AS Month, COUNT(created_at) AS Num_Completed_Tests
FROM complete_tests
WHERE MONTH(created_at)=11 OR MONTH(created_at)=12
GROUP BY 1, 2
ORDER BY 3 DESC;
```
If you then wanted to output only the test-month pairs that had at least 20 records in them, you would add a HAVING clause, because the stipulation of at least 20 records only makes sense and is only computable at the aggregated group level:

```mySQL
SELECT test_name, MONTH(created_at) AS Month, COUNT(created_at) AS Num_Completed_Tests
FROM complete_tests
WHERE MONTH(created_at)=11 OR MONTH(created_at)=12
GROUP BY 1, 2
HAVING COUNT(created_at)>=20
ORDER BY 3 DESC;
```

**Question 3: Revise the query your wrote in Question 2 so that it (1) excludes the NULL and empty string entries in the breed_group field, and (2) excludes any groups that don't have at least 1,000 distinct Dog_Guids in them.  Your result should contain 8 rows.  (HINT: sometimes empty strings are registered as non-NULL values.  You might want to include the following line somewhere in your query to exclude these values as well):**

```mySQL
breed_group!=""
```

In [23]:
%%sql 
SELECT gender, breed_group, COUNT(DISTINCT dog_guid) AS Num_Dogs
FROM dogs
WHERE breed_group IS NOT NULL and breed_group != ''
GROUP BY 2, 1
HAVING Num_Dogs >= 1000
ORDER BY 3 DESC;

 * mysql://studentuser:***@localhost/dognitiondb
8 rows affected.

[('male', 'Sporting', 2584),
 ('female', 'Sporting', 2262),
 ('male', 'Herding', 1736),
 ('female', 'Herding', 1704),
 ('male', 'Toy', 1473),
 ('female', 'Toy', 1145),
 ('male', 'Non-Sporting', 1098),
 ('male', 'Working', 1075)]

We will review several issues that can be tricky about using GROUP BY in your queries in the next lesson, but those issues will make more sense once you are sure you are comfortable with the basic functionality of the GROUP BY and HAVING clauses.  
   
      

## Practice incorporating GROUP BY and HAVING into your own queries.

**Question 4: Write a query that outputs the average number of tests completed and average mean inter-test-interval for every breed type, sorted by the average number of completed tests in descending order (popular hybrid should be the first row in your output).**

In [34]:
%%sql 
SELECT *
FROM dogs
LIMIT 1

 * mysql://studentuser:***@localhost/dognitiondb
1 rows affected.

[('female', '2011', 'Labrador Retriever', 50, 1, 0, datetime.datetime(2013, 2, 5, 3, 57, 19), datetime.datetime(2013, 7, 25, 19, 41, 49), 'charmer', None, 'Pure Breed', 'Sporting', 'fd27b272-7144-11e5-ba71-058fbc01cf0b', 'ce134e42-7144-11e5-ba71-058fbc01cf0b', '21', '28.20107581', '40609.549167', '0.004687499952', '6.7499999308', '564.0215162', '812190.98333')]

In [36]:
%%sql
SELECT breed_type, AVG(total_tests_completed) as avg_tests, AVG(mean_iti_minutes) as avg_mins
FROM dogs
GROUP BY breed_type
ORDER BY avg_tests DESC

 * mysql://studentuser:***@localhost/dognitiondb
4 rows affected.

[('Popular Hybrid', 10.257530120481928, 2834.3205728931534),
 ('Cross Breed', 9.945900537634408, 2872.351156110182),
 ('Pure Breed', 9.871602824737856, 3193.350493795222),
 ("Mixed Breed/ Other/ I Don't Know", 9.54250850170034, 3023.0711302156274)]

**Question 5: Write a query that outputs the average amount of time (IN HOURS!) it took customers to complete each type of test where any individual reaction times over 6000 MINUTES are excluded and only average reaction times that are greater than 0 are included (your output should end up with 58 rows).**

In [49]:
%%sql
SELECT test_name, AVG(TIMESTAMPDIFF(HOUR, start_time, end_time)) as AVG_TIME
FROM exam_answers
WHERE TIMESTAMPDIFF(MINUTE, start_time, end_time) < 6000
GROUP BY test_name
HAVING AVG_TIME > 0 
ORDER BY AVG_TIME DESC

 * mysql://studentuser:***@localhost/dognitiondb
58 rows affected.

[('Social-Quiz', Decimal('2.3382')),
 ('Social', Decimal('0.7465')),
 ('Diet', Decimal('0.6735')),
 ('Yawn Warm-up', Decimal('0.5921')),
 ('Activity', Decimal('0.5096')),
 ('Sociability', Decimal('0.3241')),
 ('Watching', Decimal('0.2822')),
 ('Set 3', Decimal('0.2641')),
 ('Surprise And Delight', Decimal('0.2592')),
 ('Confinement', Decimal('0.1757')),
 ('Navigation Warm-up', Decimal('0.1637')),
 ('Yawn Game', Decimal('0.1556')),
 ('Navigation Game', Decimal('0.1273')),
 ('Set 2', Decimal('0.1259')),
 ('Physical', Decimal('0.1232')),
 ('Emotions', Decimal('0.1173')),
 ('Impossible Task Warm-up', Decimal('0.1040')),
 ('Gender', Decimal('0.0882')),
 ('Watching - Part 2', Decimal('0.0834')),
 ('Stair Game', Decimal('0.0793')),
 ('Set 1', Decimal('0.0790')),
 ('Environment', Decimal('0.0779')),
 ('Turn Your Back', Decimal('0.0759')),
 ('Eye Contact Game', Decimal('0.0738')),
 ('Shaker Warm-Up', Decimal('0.0644')),
 ('Treat Warm-up', Decimal('0.0601')),
 ('Owner', Decimal('0.0567')),
 ('Cover Your Eyes', Decimal('0.0555')),
 ('Training', Decimal('0.0550')),
 ('Switch', Decimal('0.0531')),
 ('Toys', Decimal('0.0521')),
 ('Eye Contact Warm-up', Decimal('0.0513')),
 ('Different Perspective', Decimal('0.0493')),
 ('Warm-Up', Decimal('0.0486')),
 ('One Cup Warm-up', Decimal('0.0472')),
 ('Shy/Boldness', Decimal('0.0436')),
 ('Purina-Only', Decimal('0.0430')),
 ('Attachment', Decimal('0.0381')),
 ('Physical Reasoning Warm-up', Decimal('0.0351')),
 ('Perception', Decimal('0.0339')),
 ('Inferential Reasoning Warm-up', Decimal('0.0336')),
 ('Purina', Decimal('0.0327')),
 ('Puzzles', Decimal('0.0310')),
 ('Recall', Decimal('0.0296')),
 ('Foot Pointing', Decimal('0.0281')),
 ('Excitability', Decimal('0.0263')),
 ('Partnership', Decimal('0.0244')),
 ('Arm Pointing', Decimal('0.0238')),
 ('Impossible Task Game', Decimal('0.0238')),
 ('Memory versus Smell', Decimal('0.0235')),
 ('Navigation Learning', Decimal('0.0226')),
 ('Obedience', Decimal('0.0169')),
 ('Delayed Cup Game', Decimal('0.0158')),
 ('Inferential Reasoning Game', Decimal('0.0157')),
 ('Numerosity Warm-Up', Decimal('0.0116')),
 ('Two Cup Warm-up', Decimal('0.0086')),
 ('Physical Reasoning Game', Decimal('0.0065')),
 ('Memory versus Pointing', Decimal('0.0057'))]

**Question 6: Write a query that outputs the total number of unique User_Guids in each combination of State and ZIP code (postal code) in the United States, sorted first by state name in ascending alphabetical order, and second by total number of unique User_Guids in descending order (your first state should be AE and there should be 5043 rows in total in your output).**

In [50]:
%%sql 
SELECT *
FROM users
LIMIT 1

 * mysql://studentuser:***@localhost/dognitiondb
1 rows affected.

[(14, datetime.datetime(2013, 2, 5, 3, 52, 2), datetime.datetime(2015, 3, 12, 0, 25, 15), 2, 2, 1, None, None, datetime.datetime(2015, 3, 12, 0, 25, 15), 2, 'ce134e42-7144-11e5-ba71-058fbc01cf0b', 'Grand Forks', 'ND', '58201', 'US', '-6')]

In [4]:
%%sql
SELECT state, Zip, COUNT(DISTINCT user_guid) as Number_Users
FROM users
WHERE country = 'US'
GROUP BY State, Zip
ORDER BY state ASC, Number_Users DESC
LIMIT 10

 * mysql://studentuser:***@localhost/dognitiondb
10 rows affected.

[('AE', '9128', 2),
 ('AE', '9053', 1),
 ('AE', '9107', 1),
 ('AE', '9469', 1),
 ('AE', '9845', 1),
 ('AK', '99507', 3),
 ('AK', '99709', 3),
 ('AK', '99577', 2),
 ('AK', '99501', 2),
 ('AK', '99502', 1)]

**Question 7: Write a query that outputs the total number of unique User_Guids in each combination of State and ZIP code in the United States *that have at least 5 users*, sorted first by state name in ascending alphabetical order, and second by total number of unique User_Guids in descending order (your first state/ZIP code combination should be AZ/86303).**

In [5]:
%%sql
SELECT state, Zip, COUNT(DISTINCT user_guid) as Number_Users
FROM users
WHERE country = 'US'
GROUP BY State, Zip
HAVING Number_Users >= 5
ORDER BY state ASC, Number_Users DESC
LIMIT 10

 * mysql://studentuser:***@localhost/dognitiondb
10 rows affected.

[('AZ', '86303', 14),
 ('AZ', '85718', 6),
 ('AZ', '85253', 5),
 ('AZ', '85254', 5),
 ('AZ', '85260', 5),
 ('AZ', '85711', 5),
 ('AZ', '85749', 5),
 ('CA', '92107', 16),
 ('CA', '90046', 13),
 ('CA', '94107', 12)]

<mark>**Be sure to watch the next video before beginning Exercise 6, the next set of MySQL exercises</mark>,** **and feel free to practice any other queries you wish below!**

In [ ]:
%%sql